Revit 2024 API
ExternalFileReference.PathType Property
 The path type of the link (relative, absolute, or server).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public PathType PathType { get; }
Visual Basic
Public ReadOnly Property PathType As PathType
	Get
Visual C++
public:
property PathType PathType {
	PathType get ();
}
See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace